{
  "activation_dropout": 0.0,
  "activation_function": "relu",
  "architectures": [
    "DeformableDetrForObjectDetection"
  ],
  "attention_dropout": 0.0,
  "auxiliary_loss": false,
  "backbone": "resnet50",
  "bbox_cost": 5,
  "bbox_loss_coefficient": 5,
  "class_cost": 1,
  "d_model": 256,
  "decoder_attention_heads": 8,
  "decoder_ffn_dim": 1024,
  "decoder_layerdrop": 0.0,
  "decoder_layers": 6,
  "decoder_n_points": 4,
  "dice_loss_coefficient": 1,
  "dilation": false,
  "dropout": 0.1,
  "encoder_attention_heads": 8,
  "encoder_ffn_dim": 1024,
  "encoder_layerdrop": 0.0,
  "encoder_layers": 6,
  "encoder_n_points": 4,
  "eos_coefficient": 0.1,
  "giou_cost": 2,
  "giou_loss_coefficient": 2,
  "id2label": {
    "0": "bóng chày",
    "1": "bảng tỉ số",
    "2": "giày",
    "3": "găng bóng chày",
    "4": "gậy bóng chày",
    "5": "huấn luyện viên",
    "6": "khung thành",
    "7": "khán giả",
    "8": "lưới",
    "9": "quả bóng bầu dục",
    "10": "quả bóng chuyền",
    "11": "quả bóng chày",
    "12": "quả bóng rổ",
    "13": "quả bóng tennis",
    "14": "quả bóng đá",
    "15": "rổ bóng rổ",
    "16": "sân bóng chuyền",
    "17": "sân bóng chày",
    "18": "sân bóng đá",
    "19": "sân tennis",
    "20": "trẻ em",
    "21": "trọng tài",
    "22": "vận động viên",
    "23": "vợt tennis",
    "24": "đồng phục"
  },
  "init_std": 0.02,
  "init_xavier_std": 1.0,
  "is_encoder_decoder": true,
  "label2id": {
    "bóng chày": 0,
    "bảng tỉ số": 1,
    "giày": 2,
    "găng bóng chày": 3,
    "gậy bóng chày": 4,
    "huấn luyện viên": 5,
    "khung thành": 6,
    "khán giả": 7,
    "lưới": 8,
    "quả bóng bầu dục": 9,
    "quả bóng chuyền": 10,
    "quả bóng chày": 11,
    "quả bóng rổ": 12,
    "quả bóng tennis": 13,
    "quả bóng đá": 14,
    "rổ bóng rổ": 15,
    "sân bóng chuyền": 16,
    "sân bóng chày": 17,
    "sân bóng đá": 18,
    "sân tennis": 19,
    "trẻ em": 20,
    "trọng tài": 21,
    "vận động viên": 22,
    "vợt tennis": 23,
    "đồng phục": 24
  },
  "mask_loss_coefficient": 1,
  "max_position_embeddings": 1024,
  "model_type": "deformable_detr",
  "num_feature_levels": 4,
  "num_queries": 300,
  "position_embedding_type": "sine",
  "return_intermediate": true,
  "torch_dtype": "float32",
  "transformers_version": "4.16.0.dev0",
  "two_stage": false,
  "two_stage_num_proposals": 300,
  "with_box_refine": false
}