{
  "activation_dropout": 0.0,
  "activation_function": "relu",
  "architectures": [
    "DeformableDetrForObjectDetection"
  ],
  "attention_dropout": 0.0,
  "auxiliary_loss": false,
  "backbone": "resnet50",
  "bbox_cost": 5,
  "bbox_loss_coefficient": 5,
  "class_cost": 1,
  "d_model": 256,
  "decoder_attention_heads": 8,
  "decoder_ffn_dim": 1024,
  "decoder_layerdrop": 0.0,
  "decoder_layers": 6,
  "decoder_n_points": 4,
  "dice_loss_coefficient": 1,
  "dilation": false,
  "dropout": 0.1,
  "encoder_attention_heads": 8,
  "encoder_ffn_dim": 1024,
  "encoder_layerdrop": 0.0,
  "encoder_layers": 6,
  "encoder_n_points": 4,
  "eos_coefficient": 0.1,
  "giou_cost": 2,
  "giou_loss_coefficient": 2,
  "id2label": {
    "0": "bóng chày",
    "1": "bảng tỉ số",
    "2": "giày",
    "3": "găng bóng chày",
    "4": "gậy bóng chày",
    "5": "huấn luyện viên",
    "6": "khung thành",
    "7": "khán giả",
    "8": "lưới",
    "9": "quả bóng bầu dục",
    "10": "quả bóng chuyền",
    "11": "quả bóng chày",
    "12": "quả bóng rổ",
    "13": "quả bóng tennis",
    "14": "quả bóng đá",
    "15": "rổ bóng rổ",
    "16": "sân bóng chuyền",
    "17": "sân bóng chày",
    "18": "sân bóng đá",
    "19": "sân tennis",
    "20": "trẻ em",
    "21": "trọng tài",
    "22": "vận động viên",
    "23": "vợt tennis",
    "24": "đồng phục"
  },
  "init_std": 0.02,
  "init_xavier_std": 1.0,
  "is_encoder_decoder": true,
  "label2id": {
    "Không xác định": "0",
    "người": "1",
    "xe đạp": "2",
    "ô tô": "3",
    "xe máy": "4",
    "máy bay": "5",
    "xe buýt": "6",
    "tàu hỏa": "7",
    "xe tải": "8",
    "thuyền": "9",
    "đèn giao thông": "10",
    "trụ cứu hỏa": "11",
    "biển báo đường": "12",
    "biển báo dừng": "13",
    "đồng hồ đỗ xe": "14",
    "ghế băng": "15",
    "chim": "16",
    "mèo": "17",
    "chó": "18",
    "ngựa": "19",
    "cừu": "20",
    "bò": "21",
    "voi": "22",
    "gấu": "23",
    "ngựa vằn": "24",
    "hươu cao cổ": "25",
    "mũ": "26",
    "ba lô": "27",
    "ô/dù": "28",
    "giày": "29",
    "kính mắt": "30",
    "túi xách tay": "31",
    "cà vạt": "32",
    "vali": "33",
    "đĩa ném (frisbee)": "34",
    "ván trượt tuyết": "35",
    "ván trượt tuyết (snowboard)": "36",
    "bóng thể thao": "37",
    "diều": "38",
    "gậy bóng chày": "39",
    "găng bóng chày": "40",
    "ván trượt": "41",
    "ván lướt sóng": "42",
    "vợt tennis": "43",
    "chai/lọ": "44",
    "đĩa": "45",
    "ly rượu vang": "46",
    "cốc": "47",
    "nĩa": "48",
    "dao": "49",
    "thìa": "50",
    "bát/tô": "51",
    "chuối": "52",
    "táo": "53",
    "bánh mì kẹp": "54",
    "cam": "55",
    "bông cải xanh": "56",
    "cà rốt": "57",
    "xúc xích nóng": "58",
    "pizza": "59",
    "bánh vòng (donut)": "60",
    "bánh kem": "61",
    "ghế": "62",
    "ghế sô-pha": "63",
    "cây cảnh trong chậu": "64",
    "giường": "65",
    "gương": "66",
    "bàn ăn": "67",
    "cửa sổ": "68",
    "bàn làm việc": "69",
    "bồn cầu": "70",
    "cửa": "71",
    "tivi": "72",
    "máy tính xách tay": "73",
    "chuột máy tính": "74",
    "điều khiển từ xa": "75",
    "bàn phím": "76",
    "điện thoại di động": "77",
    "lò vi sóng": "78",
    "lò nướng": "79",
    "máy nướng bánh mì": "80",
    "bồn rửa": "81",
    "tủ lạnh": "82",
    "máy xay sinh tố": "83",
    "sách": "84",
    "đồng hồ": "85",
    "bình hoa": "86",
    "kéo": "87",
    "gấu bông": "88",
    "máy sấy tóc": "89",
    "bàn chải đánh răng": "90"
  },
  "mask_loss_coefficient": 1,
  "max_position_embeddings": 1024,
  "model_type": "deformable_detr",
  "num_feature_levels": 4,
  "num_queries": 300,
  "position_embedding_type": "sine",
  "return_intermediate": true,
  "torch_dtype": "float32",
  "transformers_version": "4.16.0.dev0",
  "two_stage": false,
  "two_stage_num_proposals": 300,
  "with_box_refine": false
}